benjaminkravets/KW45B41Z/kw45b41zevk_beacon_bm/component/osa/fsl_os_abstraction_bm.c
    return KOSA_StatusSuccess;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_InterruptEnable
 * Description   : self explanatory.
 *
 *END**************************************************************************/
void OSA_InterruptEnable(void)
{
    OSA_EnableIRQGlobal();
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_InterruptDisable
 * Description   : self explanatory.
 *
 *END**************************************************************************/
void OSA_InterruptDisable(void)
{
    OSA_DisableIRQGlobal();
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_InstallIntHandler
 * Description   : This function is used to install interrupt handler.
 *
 *END**************************************************************************/
void OSA_InstallIntHandler(uint32_t IRQNumber, void (*handler)(void))
{
#if defined(__IAR_SYSTEMS_ICC__)
    _Pragma("diag_suppress = Pm138")
#endif
#if defined(ENABLE_RAM_VECTOR_TABLE)
        (void) InstallIRQHandler((IRQn_Type)IRQNumber, (uint32_t) * (uint32_t *)&handler);
#endif /* ENABLE_RAM_VECTOR_TABLE. */
#if defined(__IAR_SYSTEMS_ICC__)
    _Pragma("diag_remark = PM138")
#endif
}

/*! *********************************************************************************
*************************************************************************************
* Private functions
*************************************************************************************
********************************************************************************** */
#if ((defined(FSL_OSA_TASK_ENABLE)) && (FSL_OSA_TASK_ENABLE > 0U))
#if (defined(FSL_OSA_MAIN_FUNC_ENABLE) && (FSL_OSA_MAIN_FUNC_ENABLE > 0U))
static OSA_TASK_DEFINE(main_task, gMainThreadPriority_c, 1, gMainThreadStackSize_c, 0);

void main(void)
{
    OSA_Init();

    /* Initialize MCU clock */
    extern void BOARD_InitHardware(void);
    BOARD_InitHardware();

    (void)OSA_TaskCreate((osa_task_handle_t)s_osaState.mainTaskHandle, OSA_TASK(main_task), NULL);

    OSA_Start();
}
#endif /*(defined(FSL_OSA_MAIN_FUNC_ENABLE) && (FSL_OSA_MAIN_FUNC_ENABLE > 0U))*/
#endif /* FSL_OSA_TASK_ENABLE */

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_Init
 * Description   : This function is used to setup the basic services, it should
 * be called first in function main.
 *
 *END**************************************************************************/
#if (defined(FSL_OSA_TASK_ENABLE) && (FSL_OSA_TASK_ENABLE > 0U))
void OSA_Init(void)
{
    LIST_Init((&s_osaState.taskList), 0);
    s_osaState.curTaskHandler        = NULL;
    s_osaState.interruptDisableCount = 0U;
    s_osaState.tickCounter           = 0U;
}
#endif

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_Start
 * Description   : This function is used to start RTOS scheduler.
 *
 *END**************************************************************************/
#if (defined(FSL_OSA_TASK_ENABLE) && (FSL_OSA_TASK_ENABLE > 0U))
void OSA_Start(void)
{
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    OSA_TimeInit();
#endif
    while (true)
    {
        OSA_ProcessTasks();
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_ProcessTasks
 * Description   : This function is used to process registered tasks.
 *
 *END**************************************************************************/
void OSA_ProcessTasks(void)
{
    list_element_handle_t list_element;
    task_control_block_t *tcb;

    list_element = LIST_GetHead(&s_osaState.taskList);
    while (NULL != list_element)
    {
        tcb                       = (task_control_block_t *)(void *)list_element;
        s_osaState.curTaskHandler = (osa_task_handle_t)tcb;
        if (0U != tcb->haveToRun)
        {
            if (NULL != tcb->p_func)
            {
                tcb->p_func(tcb->param);
            }
            list_element = LIST_GetHead(&s_osaState.taskList);
        }
        else
        {
            list_element = LIST_GetNext(list_element);
        }
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskShouldYield
 * Description   : When this function returns TRUE, an OSA task  has to run
 *
 *END**************************************************************************/
uint8_t OSA_TaskShouldYield(void)
{
    list_element_handle_t list_element;
    uint8_t status = 0;
    task_control_block_t *tcb;

    list_element = LIST_GetHead(&s_osaState.taskList);
    while ((list_element != NULL))
    {
        tcb = (task_control_block_t *)(void *)list_element;
        if (1U == tcb->haveToRun)
        {
            status = 1U;
            break;
        }
        list_element = LIST_GetNext(list_element);
    }
    return status;
}
#endif

/*FUNCTION**********************************************************************
 *
 * Function Name : SysTick_Handler
 * Description   : This ISR of the SYSTICK timer.
 *
 *END**************************************************************************/
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
void SysTick_Handler(void);
void SysTick_Handler(void)
{
    s_osaState.tickCounter++;
}
#endif

void OSA_UpdateSysTickCounter(uint32_t corr)
{
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    s_osaState.tickCounter += corr;
#else
#endif
}

